**Testing the CUMULATIVE CALCULATOR function**

In [1]:
import pandas as pd
from cumcalc import get_cumseries

Dataset

In [2]:
ab_data = pd.read_csv('data/ab_data.zip')

ab_data

        user_id   timestamp group  converted
0        851104  2017-01-21     A          0
1        804228  2017-01-12     A          0
2        661590  2017-01-11     B          0
3        853541  2017-01-08     B          0
4        864975  2017-01-21     A          1
...         ...         ...   ...        ...
290477   751197  2017-01-03     A          0
290478   945152  2017-01-12     A          0
290479   734608  2017-01-22     A          0
290480   697314  2017-01-15     A          0
290481   715931  2017-01-16     B          0

[290482 rows x 4 columns]

Certain needful changes

In [3]:
ab_data['timestamp'] = pd.to_datetime(ab_data['timestamp'])
ab_data['group'] = ab_data['group'].astype('category')

daily_data = ab_data.groupby(['timestamp','group']).agg({
    'user_id':'count',
    'converted':'sum'
}).reset_index().rename(columns={'user_id': 'users_count'})

daily_data['conversion'] = daily_data['converted'] / daily_data['users_count'] * 100

daily_data.head(10)

   timestamp group  users_count  converted  conversion
0 2017-01-02     A         2851        357   12.521922
1 2017-01-02     B         2848        339   11.903090
2 2017-01-03     A         6584        749   11.376063
3 2017-01-03     B         6620        754   11.389728
4 2017-01-04     A         6573        797   12.125361
5 2017-01-04     B         6538        763   11.670236
6 2017-01-05     A         6419        791   12.322792
7 2017-01-05     B         6509        743   11.414964
8 2017-01-06     A         6604        762   11.538462
9 2017-01-06     B         6735        834   12.383073

Cum. calculation without function

In [4]:
d_data_nocum = daily_data.copy()

d_data_nocum['cum_users_count'] = d_data_nocum.groupby(['group'])['users_count'].cumsum()

d_data_nocum['cum_converted'] = d_data_nocum.groupby(['group'])['converted'].cumsum()

d_data_nocum.head(10)

,timestamp,group,users_count,converted,conversion,cum_users_count,cum_converted
0,2017-01-02,A,2851,357,12.521922,2851,357
1,2017-01-02,B,2848,339,11.903090,2848,339
2,2017-01-03,A,6584,749,11.376063,9435,1106
3,2017-01-03,B,6620,754,11.389728,9468,1093
4,2017-01-04,A,6573,797,12.125361,16008,1903
5,2017-01-04,B,6538,763,11.670236,16006,1856
6,2017-01-05,A,6419,791,12.322792,22427,2694
7,2017-01-05,B,6509,743,11.414964,22515,2599
8,2017-01-06,A,6604,762,11.538462,29031,3456
9,2017-01-06,B,6735,834,12.383073,29250,3433

Cum. calculation with function (no groupby)

In [5]:
daily_cum1 = get_cumseries(data=daily_data, 
                           cols=['users_count', 'converted'])

daily_cum1.head(10)

,timestamp,group,users_count,converted,conversion,cum_users_count,cum_converted
0,2017-01-02,A,2851,357,12.521922,2851,357
1,2017-01-02,B,2848,339,11.903090,5699,696
2,2017-01-03,A,6584,749,11.376063,12283,1445
3,2017-01-03,B,6620,754,11.389728,18903,2199
4,2017-01-04,A,6573,797,12.125361,25476,2996
5,2017-01-04,B,6538,763,11.670236,32014,3759
6,2017-01-05,A,6419,791,12.322792,38433,4550
7,2017-01-05,B,6509,743,11.414964,44942,5293
8,2017-01-06,A,6604,762,11.538462,51546,6055
9,2017-01-06,B,6735,834,12.383073,58281,6889

Cum. calculation with function (with groupby)

In [6]:
daily_cum2 = get_cumseries(data=daily_data, 
                           cols=['users_count', 'converted'],
                           groupby='group')

daily_cum2.head(10)

,timestamp,group,users_count,converted,conversion,cum_users_count,cum_converted
0,2017-01-02,A,2851,357,12.521922,2851,357
1,2017-01-02,B,2848,339,11.903090,5699,696
2,2017-01-03,A,6584,749,11.376063,12283,1445
3,2017-01-03,B,6620,754,11.389728,18903,2199
4,2017-01-04,A,6573,797,12.125361,25476,2996
5,2017-01-04,B,6538,763,11.670236,32014,3759
6,2017-01-05,A,6419,791,12.322792,38433,4550
7,2017-01-05,B,6509,743,11.414964,44942,5293
8,2017-01-06,A,6604,762,11.538462,51546,6055
9,2017-01-06,B,6735,834,12.383073,58281,6889